ЖКХ/src/Documents/Оплата/Оплата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Оплата</name>
  <comment>Оплата по лицевому счету</comment>
  <basedOn>Document.ВыставленныеСчета</basedOn>
  <registerRecords>AccumulationRegister.Оплаты</registerRecords>
  <attributes>
    <name>ЛицевойСчет</name>
    <type>
      <types>CatalogRef.ЛицевыеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ВыставленныеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

ЖКХ/src/AccumulationRegisters/Оплаты/Оплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Оплаты</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЛицевойСчет</name>
    <type>
      <types>CatalogRef.ЛицевыеСчета</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ЖКХ/src/Documents/ВыставленныеСчета/ВыставленныеСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыставленныеСчета</name>
  <comment>Счета за коммунальные услуги</comment>
  <registerRecords>AccumulationRegister.ПотреблениеРесурсов</registerRecords>
  <registerRecords>InformationRegister.Тарифы</registerRecords>
  <registerRecords>AccumulationRegister.Начисления</registerRecords>
  <attributes>
    <name>ЛицевойСчет</name>
    <type>
      <types>CatalogRef.ЛицевыеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Недвижимость</name>
    <type>
      <types>CatalogRef.ОбъектыНедвижимости</types>
    </type>
  </attributes>
  <attributes>
    <name>Оплачено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыРесурсов</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тариф</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Начислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пени</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Перерасчеты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Задолженность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Льготы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оплачено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЖКХ/src/Documents/Оплата/ObjectModule.bsl
#Область ОбработчикиСобытий

// Заполняет документ при вводе на основании выставленного счета.
//
// Параметры:
//  ДанныеЗаполнения - ДокументСсылка.ВыставленныеСчета - счет-основание.
//  СтандартнаяОбработка - Булево - признак стандартной обработки заполнения.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("ДокументСсылка.ВыставленныеСчета") Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыСчета = РеквизитыСчетаОснования(ДанныеЗаполнения);
	
	Основание = ДанныеЗаполнения;
	ЛицевойСчет = РеквизитыСчета.ЛицевойСчет;
	Сумма = РеквизитыСчета.СуммаКОплате;
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ЗаполняемыеРеквизиты)
	
	Если НЕ ЗначениеЗаполнено(ЛицевойСчет) Тогда
		Отказ = Истина;
		ОбщегоНазначенияЖКХКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Не заполнен лицевой счет.'"), "ЛицевойСчет");
	КонецЕсли;
	
	Если Сумма <= 0 Тогда
		Отказ = Истина;
		ОбщегоНазначенияЖКХКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Сумма оплаты должна быть больше нуля.'"), "Сумма");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Движения.Оплаты.Записывать = Истина;
	
	Движение = Движения.Оплаты.Добавить();
	Движение.Период = Дата;
	Движение.ЛицевойСчет = ЛицевойСчет;
	Движение.Сумма = Сумма;
	
	// Счет-основание помечается оплаченным; запись выполняется без перепроведения.
	Документы.ВыставленныеСчета.УстановитьПризнакОплаты(Основание, Истина);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПризнакОплатыОснования();
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПризнакОплатыОснования();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает лицевой счет и сумму к оплате по выставленному счету.
//
// Сумма к оплате = Начислено за период + (Задолженность - Оплачено).
//
// Параметры:
//  Ссылка - ДокументСсылка.ВыставленныеСчета - выставленный счет.
//
// Возвращаемое значение:
//  Структура:
//   * ЛицевойСчет - СправочникСсылка.ЛицевыеСчета - лицевой счет счета.
//   * СуммаКОплате - Число - сумма к оплате.
//
Функция РеквизитыСчетаОснования(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВыставленныеСчета.ЛицевойСчет КАК ЛицевойСчет,
	|	ЕСТЬNULL(СУММА(УслугиСчета.Начислено), 0) КАК Начислено,
	|	ЕСТЬNULL(СУММА(УслугиСчета.Задолженность), 0) КАК Задолженность,
	|	ЕСТЬNULL(СУММА(УслугиСчета.Оплачено), 0) КАК Оплачено
	|ИЗ
	|	Документ.ВыставленныеСчета КАК ВыставленныеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыставленныеСчета.Услуги КАК УслугиСчета
	|		ПО УслугиСчета.Ссылка = ВыставленныеСчета.Ссылка
	|ГДЕ
	|	ВыставленныеСчета.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыставленныеСчета.ЛицевойСчет";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Структура;
	Результат.Вставить("ЛицевойСчет", Справочники.ЛицевыеСчета.ПустаяСсылка());
	Результат.Вставить("СуммаКОплате", 0);
	
	Если Выборка.Следующий() Тогда
		Результат.ЛицевойСчет = Выборка.ЛицевойСчет;
		Результат.СуммаКОплате = Выборка.Начислено + Выборка.Задолженность - Выборка.Оплачено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Пересчитывает признак оплаты счета-основания по остальным проведенным оплатам.
// Текущая оплата исключается: при отмене проведения или удалении она еще числится проведенной.
//
Процедура ОбновитьПризнакОплатыОснования()
	
	Оплачено = Документы.ВыставленныеСчета.ЕстьПроведеннаяОплата(Основание, Ссылка);
	Документы.ВыставленныеСчета.УстановитьПризнакОплаты(Основание, Оплачено);
	
КонецПроцедуры

#КонецОбласти
